Revit 2024 API
BalusterPlacement.Dispose Method
Releases all resources used by the BalusterPlacement
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace